In [10]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt


df = pd.read_csv('practiceday15.csv') 
df

   EmployeeID EmployeeName    Age  Salary  Price  Marks1  Marks2  Marks3
0        E101        Alice     25   50000   1200      85      90    88.0
1        E102          Bob     30   60000   1500      78      82    80.0
2        E103      Charlie     22   52000   1100      92      95    90.0
3        E101        Alice     25   50000   1200      85      90    88.0
4        E104        David     45   80000   2500      88      85    89.0
5        E105          Eve     29   58000   1300      76      79    81.0
6        E106        Frank  75000    2200     90      91      92     NaN
7        E107        Grace     34    1900     81      83      80     NaN
8        E108        Heidi     38    1800     84      86      88     NaN
9        E109         Ivan     26   53000   1400      95      92    94.0
10       E102          Bob     30   60000   1500      78      82    80.0